import { Container } from "../shared/Container";
import { Paragraph } from "../shared/Paragraph";
import { Title } from "../shared/Title";
import weiliAbout from "/assets/weiliAbout.jpg"
import { Info } from "../cards/Info";

export const AboutMe = () => {
  return <section id="about-me">
    <Container className="flex flex-col md:flex-row gap-10 lg:gap-12 items-center">
      <div className="w-full md:w-5/12 lg:w-1/2">
        <div className="w-full h-auto sm:h-auto relative">
          <img
            src={weiliAbout}
            className="w-full h-full object-cover rounded-3xl shadow-lg relative z-10"
            alt="About Me"
          />
        </div>
      </div>
      <div className="w-full md:w-7/12 lg:w-1/2 flex flex-col">
        <Title>
          关于我们
        </Title>
        <Paragraph>
          大家好呀～如果要聊起我心里最特别的 “双向奔赴”，那一定是《魔法使光之美少女》里的朝日奈未来和十六夜理子啦！对我来说，她们不只是动画里的角色，更像陪我走过很多时光的 “老朋友”，我对她们的偏爱，藏在每一个让我心动的小细节里。​
我喜欢盯着她们初遇时的画面反复看 —— 未来蹦蹦跳跳说着 “我超喜欢魔法使！” 时眼里的光，理子攥着 “波纹翡翠” 略显拘谨却坚定的样子，明明性格差了一大截，却在面对欲望怪时本能地站到一起，喊出 “Cure Up・Rapapa!” 变身的瞬间，我总觉得那不是简单的 “组队”，而是命运把两个契合的灵魂绑在了一起。后来看她们在魔法学校一起练咒语，未来会因为记错手势闹笑话，理子嘴上说着 “笨蛋”，却悄悄放慢动作再教一遍；一起做相遇纪念日蛋糕时，未来把蛋糕糊蹭到理子脸上，还调皮地尝了一口，理子红着脸用指尖蘸了糊点在未来鼻尖，那种带着点笨拙的亲昵，每次看都能让我嘴角忍不住上扬 —— 这就是我心里最棒的 “日常磕点”，没有轰轰烈烈，却满是藏不住的在意。​
我还特别念着她们分别又重逢的那段。未来回到人类世界成了大学生，背包上还挂着当年的魔法挂件；理子在魔法学校当老师，书本里夹着和未来一起拍的旧照片书签，明明隔着两个世界，却都把对方留在了生活里。后来新危机出现，她们再次变身时，不需要多言就有的默契，那句熟悉的咒语一出来，我鼻子都有点酸 —— 原来有些感情真的不会被时间和距离冲淡，反而会变成更坚定的牵挂。现在我看到 “Cure Up・Rapapa” 这几个字，就会立刻想到她们：未来把它当论文密码，理子用它当点名口号，对我来说，这也成了专属的 “暗号”，一看到就会想起，曾有两个女孩用魔法守护世界，也用真心守护着彼此。​
所以呀，说起我与未来理子的故事，其实就是我在她们的冒险里，看到了最纯粹的陪伴与奔赴 —— 我喜欢她们的互补，喜欢她们的共患难，喜欢她们把彼此刻进生活的小细节，更喜欢她们让我相信：好的感情，是不管走多远，回头时对方都还在。这就是我，一个会为未来理子的每一个互动心动，会把她们的故事藏在心里的普通喜欢者～
        </Paragraph>
        <div className="pt-8 grid grid-cols-1 sm:grid-cols-2 gap-4 max-w-3xl">
          <Info title="Mission" description="Something genertic">
            <svg   viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="17505" width="50" height="50"><path d="M524.2 653h-0.7c-165.8-2.4-298.9-70.3-365.3-186.3-65.4-114.5-54.8-270.4 28.6-417.2 7.8-13.6 22.9-21.9 38.1-21.8C342.6 29.4 444.3 68.8 519 141.4c17.1 16.6 17.5 43.9 0.8 61-16.6 17-43.9 17.5-61 0.8-53.3-51.8-125.3-82.1-209.5-88.2-57 112.7-63.4 226.7-16.4 308.8 50.9 88.9 157.2 141 291.7 142.9 23.8 0.3 42.8 19.9 42.5 43.7-0.2 23.7-19.4 42.6-42.9 42.6z" fill="#A06AFF" p-id="17506"></path><path d="M531.9 651.5c-13.4 0-26.1-6.2-34.3-17-99-130.3-124.5-272.3-71.9-399.7C477.9 108.5 602.1 23.1 766.4 0.5c15.5-2.4 30.8 4.2 40.2 16.6 100.4 132.1 128 280.2 75.8 406.4-50.2 121.3-175.8 204.3-344.7 227.6-1.8 0.2-3.8 0.4-5.8 0.4z m-26.5-383.8c-37.9 91.6-21.5 195.1 45.9 293.9 82.7-15.2 204.3-57 251.4-171C840.3 299.7 822 191.3 752.9 90 632.5 112.9 543 176.8 505.4 267.7z" fill="#FF6AD4" p-id="17507"></path><path d="M336.4 870.3c-7.1 0-14.2-1.7-20.8-5.4-35.3-19.5-67.3-44.3-95.2-73.5-16.4-17.2-15.8-44.5 1.4-60.9 17.2-16.5 44.5-15.9 61 1.4 21.9 22.9 47 42.3 74.6 57.6 20.8 11.5 28.4 37.8 16.8 58.6-7.9 14.2-22.6 22.2-37.8 22.2zM685.6 867.1c-14.9 0-29.4-7.7-37.4-21.5-11.9-20.6-4.9-47 15.7-58.9 25.7-14.9 49.2-33.3 69.7-54.8 16.5-17.2 43.7-17.8 60.9-1.3 17.2 16.5 17.8 43.7 1.4 61-26.1 27.4-56.1 50.9-88.9 69.8-6.7 3.9-14.1 5.7-21.4 5.7z" fill="#A06AFF" p-id="17508"></path><path d="M508.2 1024c-23.8 0-43.1-19.3-43.1-43.1V702.4c0-23.8 19.3-43.1 43.1-43.1s43.1 19.3 43.1 43.1v278.5c0 23.8-19.3 43.1-43.1 43.1z" fill="#FF6AD4" p-id="17509"></path></svg>
          </Info>
          <Info title="Mission" description="Something genertic">
            <svg   viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="17505" width="50" height="50"><path d="M524.2 653h-0.7c-165.8-2.4-298.9-70.3-365.3-186.3-65.4-114.5-54.8-270.4 28.6-417.2 7.8-13.6 22.9-21.9 38.1-21.8C342.6 29.4 444.3 68.8 519 141.4c17.1 16.6 17.5 43.9 0.8 61-16.6 17-43.9 17.5-61 0.8-53.3-51.8-125.3-82.1-209.5-88.2-57 112.7-63.4 226.7-16.4 308.8 50.9 88.9 157.2 141 291.7 142.9 23.8 0.3 42.8 19.9 42.5 43.7-0.2 23.7-19.4 42.6-42.9 42.6z" fill="#A06AFF" p-id="17506"></path><path d="M531.9 651.5c-13.4 0-26.1-6.2-34.3-17-99-130.3-124.5-272.3-71.9-399.7C477.9 108.5 602.1 23.1 766.4 0.5c15.5-2.4 30.8 4.2 40.2 16.6 100.4 132.1 128 280.2 75.8 406.4-50.2 121.3-175.8 204.3-344.7 227.6-1.8 0.2-3.8 0.4-5.8 0.4z m-26.5-383.8c-37.9 91.6-21.5 195.1 45.9 293.9 82.7-15.2 204.3-57 251.4-171C840.3 299.7 822 191.3 752.9 90 632.5 112.9 543 176.8 505.4 267.7z" fill="#FF6AD4" p-id="17507"></path><path d="M336.4 870.3c-7.1 0-14.2-1.7-20.8-5.4-35.3-19.5-67.3-44.3-95.2-73.5-16.4-17.2-15.8-44.5 1.4-60.9 17.2-16.5 44.5-15.9 61 1.4 21.9 22.9 47 42.3 74.6 57.6 20.8 11.5 28.4 37.8 16.8 58.6-7.9 14.2-22.6 22.2-37.8 22.2zM685.6 867.1c-14.9 0-29.4-7.7-37.4-21.5-11.9-20.6-4.9-47 15.7-58.9 25.7-14.9 49.2-33.3 69.7-54.8 16.5-17.2 43.7-17.8 60.9-1.3 17.2 16.5 17.8 43.7 1.4 61-26.1 27.4-56.1 50.9-88.9 69.8-6.7 3.9-14.1 5.7-21.4 5.7z" fill="#A06AFF" p-id="17508"></path><path d="M508.2 1024c-23.8 0-43.1-19.3-43.1-43.1V702.4c0-23.8 19.3-43.1 43.1-43.1s43.1 19.3 43.1 43.1v278.5c0 23.8-19.3 43.1-43.1 43.1z" fill="#FF6AD4" p-id="17509"></path></svg>
          </Info>
        </div>
      </div>
    </Container>
  </section>;
}